{
  "topics": [
    {
      "title": "LU1: Fundamental of Communication",
      "reflection": "This unit truly brought to light the foundational elements of communication that we often take for granted. While I've always understood that communication is crucial, going into concepts like encoding, decoding, and the various types (intrapersonal, interpersonal, etc.) added a new layer of depth. It's fascinating to realize how much of our daily lives, from personal thoughts to public interactions, are underpinned by these processes. This knowledge is definitely beneficial for every aspect of life, helping to consciously improve how I send and receive messages, whether it's in personal relationships or future professional settings.",
      "image": "/public/LU1.jpg"
    },
    {
      "title": "LU2: Perception, the Self, and Communication",
      "reflection": "Exploring perception and its link to self-concept, self-awareness, and self-esteem was particularly insightful. I've always been aware that people see things differently, but the Johari Window model really crystallized how much information about ourselves is unknown to us but known to others, or even unknown to everyone. This unit deepened my understanding of how our internal perceptions heavily influence our communication, and it's a great reminder to constantly reflect on my own biases and how I present myself. Understanding these dynamics is invaluable for building stronger relationships and navigating social interactions with more empathy.",
      "image": "/public/LU2.jpg"
    },
    {
      "title": "LU3: Language and Meaning",
      "reflection": "This unit highlighted the incredible power and subtle complexities of language. The breakdown of how words function—as symbols, arbitrary, ambiguous, and abstract, yet also denotative and connotative—was a good refresher. It really hammered home the idea that \"meanings are in people,\" not just in the words themselves, and how culture profoundly shapes our understanding. I've definitely experienced misunderstandings due to ambiguous language, so the practical advice on being clear, specific, and unbiased is something I'll actively apply. This will undoubtedly help prevent miscommunications in both casual conversations and more formal academic or career-related discussions.",
      "image": "/public/LU3.jpg"
    },
    {
      "title": "LU4: Nonverbal Communication",
      "reflection": "Nonverbal communication is a topic I thought I knew well, but this unit truly expanded on its vast importance. The discussion on how nonverbal cues interact with verbal messages—accenting, complementing, contradicting, and even substituting—was particularly illuminating. I've always instinctively used or read body language, but now understanding specific categories like kinesics, proxemics, and haptics provides a more structured framework. Recognizing how much our feelings and attitudes are conveyed nonverbally, and how these messages are often more believable, will be incredibly useful for enhancing my presence and interpreting others' true intentions in any social or professional context.",
      "image": "/public/LU4.jpg"
    },
    {
      "title": "LU5: Mindful Listening",
      "reflection": "This unit was a wake-up call to the art of mindful listening. While I often believe myself to be a good listener, the distinction between merely hearing and actively listening, involving understanding, remembering, evaluating, and responding, was a crucial takeaway. The exploration of obstacles like preoccupation and prejudgment, and the various forms of non-listening (pseudo-listening, monopolizing, ambushing), made me realize areas for significant improvement. This enhanced understanding of the listening process is vital, as effective listening underpins successful interactions in every facet of life, from academic collaborations to personal relationships.",
      "image": "/public/LU5.jpg"
    },
    {
      "title": "LU6: Communication Contexts",
      "reflection": "Diving into interpersonal relationships and their various stages was quite relatable. The six-stage model, from contact to dissolution, provided a clear framework for understanding the dynamic nature of relationships. It was interesting to consider how different love and family types impact communication patterns, and the importance of self-disclosure in building intimacy. While much of this is intuitive, having the concepts explicitly defined allows for a more conscious approach to fostering and maintaining healthy connections, whether they are friendships, romantic partnerships, or family bonds. This knowledge empowers me to navigate personal relationships with greater insight.",
      "image": "/public/LU6.jpg"
    },
    {
      "title": "LU7: Small Group Communication",
      "reflection": "This unit provided a solid understanding of how groups function, highlighting the interdependence of members and the pursuit of common goals. I've certainly been part of many group projects throughout my studies, and this unit's breakdown of formal/informal roles (task, maintenance, disruptive) and the advantages/disadvantages of group work was very relevant. The concept of group dialectics, balancing competing forces like individual vs. group goals or conflict vs. cohesion, offers a practical lens for improving group dynamics. This learning will undoubtedly make me a more effective team member and leader in academic and future professional group settings.",
      "image": "/public/LU7.jpg"
    },
    {
      "title": "LU8: Organizational Communication",
      "reflection": "Exploring organizational communication shed light on the intricate web of interactions within structured environments. The discussion on traditional bureaucratic vs. participatory structures, and the flow of formal and informal communication (like the grapevine), was quite eye-opening. I particularly resonated with the idea of \"organizational assimilation\"—how individuals integrate into a company's culture. Understanding these dynamics is crucial for anyone entering the workforce, as it provides a roadmap for navigating workplace politics, effectively contributing to team goals, and understanding how messages flow to improve my own communication competence in a professional setting.",
      "image": "/public/LU8.jpg"
    },
    {
      "title": "LU9: Conflict Management",
      "reflection": "This unit on conflict management was incredibly practical and demystified many common \"conflict myths.\" The distinction between functional and dysfunctional conflict, and the idea that conflict isn't always destructive, was a significant realization. Learning about the different conflict styles (avoiding, accommodating, competing, compromising, collaborating) and how power dynamics influence conflict resolution provided concrete strategies. I've definitely found myself using different styles depending on the situation, and now I have a better understanding of when each might be appropriate. These skills are invaluable for maintaining healthy relationships and productive work environments, whether addressing personal disagreements or professional challenges.",
      "image": "/public/LU9.jpg"
    },
    {
      "title": "LU10: Communication and Media",
      "reflection": "This unit was particularly relevant in today's digital age, offering a comprehensive overview of social media and its pervasive impact. Understanding the various types of platforms, from social networking to media sharing, and the dual nature of their impacts—both positive (connection, education, marketing) and negative (mental health issues, misinformation, cyberbullying)—was a clear and concise summary. I was already aware of many of these points, but the structured presentation of pros and cons, especially regarding privacy concerns and viral marketing, solidified my understanding. This knowledge is essential for responsibly navigating the digital landscape, both personally and professionally, and leveraging social media effectively while mitigating its risks.",
      "image": "/public/LU10.jpg"
    }
  ]
}
